Show / Hide Table of Contents
Class MatSteelIND
Material steel IND
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatSteel
MatSteelIND
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.IND.MatSteelIND,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelIND : MatSteel
Properties
Improve this Doc   View Source
fu
Ultimate strength
Declaration
public double fu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fy
Yield strength
Declaration
public double fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaOVfu
Overstrength coefficient for fu
Declaration
public double GammaOVfu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaOVfy
Overstrength coefficient for fy
Declaration
public double GammaOVfy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaterialStrength
Material strength for specific thickness of plate
Declaration
public MaterialStrengthProperty MaterialStrength { get; set; }
Property Value
 Type |  Description
 MaterialStrengthProperty
 Improve this Doc
 View Source